#    додано щонайменше 10 працівників, мінімальна зарплата має бути менше за 1000, максимальна - більше за 5 000, мають бути всі технічні рівні (Trainee, Junior, Middle, Senior)
#    додано щонайменше 5 клієнтів
#    додано щонайменше 10 проєктів. Тривалість кожного проєкту (різниця START_DATE та FINISH_DATE) має бути від 1 до 100 місяців.
#    назначені працівники на кожен проєкт. Над кожним проєктом має працювати від 1 до 5 працівників.
#

# Worker
#	NAME 		BD	LEVEL		SALARY
INSERT  INTO worker (name, birthday, level, salary) VALUES
 	(Ramesh, '1989-01-02', 'Middle', 5000),
 	(Khilan, '2000-03-22', 'Trainee', 1500),
 	(Kaushik, '2003-01-01','Middle', 4000),
 	(Chaitali, '1998-10-23', 'Junior', 6500),
 	(Hardik, '1964-11-12', 'Senior', 8500),
 	(Komal, '1972-01-09',  'Middle', 4500),
 	(Muffy, '1989-02-13', 'Junior', 2500),
 	(Lokesh, '1998-02-09', 'Trainee', 1900),
	(Sarat, '1990-01-06', 'Senior', 14050),
	(Kali, '1992-05-06', 'Senior', 9800);
#Client
	#name

	Mario
	Lui
	Kai
	Boris
	Frank

#Project
	#start		end
	2004-05-01	2008-09-21
	2007-08-07	2010-03-01
	2019-02-01	2020-02-11
	2007-09-09	2018-11-11
	2022-02-24	2023-06-13

	2017-12-03	2020-09-13
	2022-01-11	2022-04-12
	2023-01-12	2023-09-11
	2023-05-09	2023-07-27
	2024-01-01	2025-12-12

# project_worker
